espressif/esp-idf/components/soc/esp32h2/register/soc/pcr_reg.h
/** PCR_I2C0_SCLK_CONF_REG register
 *  I2C_SCLK configuration register
 */
#define PCR_I2C0_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x24)
/** PCR_I2C0_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C0_SCLK_DIV_A    0x0000003FU
#define PCR_I2C0_SCLK_DIV_A_M  (PCR_I2C0_SCLK_DIV_A_V << PCR_I2C0_SCLK_DIV_A_S)
#define PCR_I2C0_SCLK_DIV_A_V  0x0000003FU
#define PCR_I2C0_SCLK_DIV_A_S  0
/** PCR_I2C0_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C0_SCLK_DIV_B    0x0000003FU
#define PCR_I2C0_SCLK_DIV_B_M  (PCR_I2C0_SCLK_DIV_B_V << PCR_I2C0_SCLK_DIV_B_S)
#define PCR_I2C0_SCLK_DIV_B_V  0x0000003FU
#define PCR_I2C0_SCLK_DIV_B_S  6
/** PCR_I2C0_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C0_SCLK_DIV_NUM    0x000000FFU
#define PCR_I2C0_SCLK_DIV_NUM_M  (PCR_I2C0_SCLK_DIV_NUM_V << PCR_I2C0_SCLK_DIV_NUM_S)
#define PCR_I2C0_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_I2C0_SCLK_DIV_NUM_S  12
/** PCR_I2C0_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 *  set this field to select clock-source. 0(default): XTAL, 1: FOSC.
 */
#define PCR_I2C0_SCLK_SEL    (BIT(20))
#define PCR_I2C0_SCLK_SEL_M  (PCR_I2C0_SCLK_SEL_V << PCR_I2C0_SCLK_SEL_S)
#define PCR_I2C0_SCLK_SEL_V  0x00000001U
#define PCR_I2C0_SCLK_SEL_S  20
/** PCR_I2C0_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable i2c function clock
 */
#define PCR_I2C0_SCLK_EN    (BIT(22))
#define PCR_I2C0_SCLK_EN_M  (PCR_I2C0_SCLK_EN_V << PCR_I2C0_SCLK_EN_S)
#define PCR_I2C0_SCLK_EN_V  0x00000001U
#define PCR_I2C0_SCLK_EN_S  22

/** PCR_I2C1_CONF_REG register
 *  I2C configuration register
 */
#define PCR_I2C1_CONF_REG (DR_REG_PCR_BASE + 0x28)
/** PCR_I2C1_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable i2c apb clock
 */
#define PCR_I2C1_CLK_EN    (BIT(0))
#define PCR_I2C1_CLK_EN_M  (PCR_I2C1_CLK_EN_V << PCR_I2C1_CLK_EN_S)
#define PCR_I2C1_CLK_EN_V  0x00000001U
#define PCR_I2C1_CLK_EN_S  0
/** PCR_I2C1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 0 to reset i2c module
 */
#define PCR_I2C1_RST_EN    (BIT(1))
#define PCR_I2C1_RST_EN_M  (PCR_I2C1_RST_EN_V << PCR_I2C1_RST_EN_S)
#define PCR_I2C1_RST_EN_V  0x00000001U
#define PCR_I2C1_RST_EN_S  1
/** PCR_I2C1_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset i2c1 module
 */
#define PCR_I2C1_READY    (BIT(2))
#define PCR_I2C1_READY_M  (PCR_I2C1_READY_V << PCR_I2C1_READY_S)
#define PCR_I2C1_READY_V  0x00000001U
#define PCR_I2C1_READY_S  2

/** PCR_I2C1_SCLK_CONF_REG register
 *  I2C_SCLK configuration register
 */
#define PCR_I2C1_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x2c)
/** PCR_I2C1_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C1_SCLK_DIV_A    0x0000003FU
#define PCR_I2C1_SCLK_DIV_A_M  (PCR_I2C1_SCLK_DIV_A_V << PCR_I2C1_SCLK_DIV_A_S)
#define PCR_I2C1_SCLK_DIV_A_V  0x0000003FU
#define PCR_I2C1_SCLK_DIV_A_S  0
/** PCR_I2C1_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C1_SCLK_DIV_B    0x0000003FU
#define PCR_I2C1_SCLK_DIV_B_M  (PCR_I2C1_SCLK_DIV_B_V << PCR_I2C1_SCLK_DIV_B_S)
#define PCR_I2C1_SCLK_DIV_B_V  0x0000003FU
#define PCR_I2C1_SCLK_DIV_B_S  6
/** PCR_I2C1_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C1_SCLK_DIV_NUM    0x000000FFU
#define PCR_I2C1_SCLK_DIV_NUM_M  (PCR_I2C1_SCLK_DIV_NUM_V << PCR_I2C1_SCLK_DIV_NUM_S)
#define PCR_I2C1_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_I2C1_SCLK_DIV_NUM_S  12
/** PCR_I2C1_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 *  set this field to select clock-source. 0(default): XTAL, 1: FOSC.
 */
#define PCR_I2C1_SCLK_SEL    (BIT(20))
#define PCR_I2C1_SCLK_SEL_M  (PCR_I2C1_SCLK_SEL_V << PCR_I2C1_SCLK_SEL_S)
#define PCR_I2C1_SCLK_SEL_V  0x00000001U
#define PCR_I2C1_SCLK_SEL_S  20
/** PCR_I2C1_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable i2c function clock
 */
#define PCR_I2C1_SCLK_EN    (BIT(22))
#define PCR_I2C1_SCLK_EN_M  (PCR_I2C1_SCLK_EN_V << PCR_I2C1_SCLK_EN_S)
#define PCR_I2C1_SCLK_EN_V  0x00000001U
#define PCR_I2C1_SCLK_EN_S  22

/** PCR_UHCI_CONF_REG register
 *  UHCI configuration register
 */
#define PCR_UHCI_CONF_REG (DR_REG_PCR_BASE + 0x30)
/** PCR_UHCI_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable uhci clock
 */
#define PCR_UHCI_CLK_EN    (BIT(0))
#define PCR_UHCI_CLK_EN_M  (PCR_UHCI_CLK_EN_V << PCR_UHCI_CLK_EN_S)
#define PCR_UHCI_CLK_EN_V  0x00000001U
#define PCR_UHCI_CLK_EN_S  0
/** PCR_UHCI_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 0 to reset uhci module
 */
#define PCR_UHCI_RST_EN    (BIT(1))
#define PCR_UHCI_RST_EN_M  (PCR_UHCI_RST_EN_V << PCR_UHCI_RST_EN_S)
#define PCR_UHCI_RST_EN_V  0x00000001U
#define PCR_UHCI_RST_EN_S  1
/** PCR_UHCI_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset uhci module
 */
#define PCR_UHCI_READY    (BIT(2))
#define PCR_UHCI_READY_M  (PCR_UHCI_READY_V << PCR_UHCI_READY_S)
#define PCR_UHCI_READY_V  0x00000001U
#define PCR_UHCI_READY_S  2

/** PCR_RMT_CONF_REG register
 *  RMT configuration register
 */
#define PCR_RMT_CONF_REG (DR_REG_PCR_BASE + 0x34)
/** PCR_RMT_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable rmt apb clock
 */
#define PCR_RMT_CLK_EN    (BIT(0))
#define PCR_RMT_CLK_EN_M  (PCR_RMT_CLK_EN_V << PCR_RMT_CLK_EN_S)
#define PCR_RMT_CLK_EN_V  0x00000001U
#define PCR_RMT_CLK_EN_S  0
/** PCR_RMT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 0 to reset rmt module
 */
#define PCR_RMT_RST_EN    (BIT(1))
#define PCR_RMT_RST_EN_M  (PCR_RMT_RST_EN_V << PCR_RMT_RST_EN_S)
#define PCR_RMT_RST_EN_V  0x00000001U
#define PCR_RMT_RST_EN_S  1
/** PCR_RMT_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset rmt module
 */
#define PCR_RMT_READY    (BIT(2))
#define PCR_RMT_READY_M  (PCR_RMT_READY_V << PCR_RMT_READY_S)
#define PCR_RMT_READY_V  0x00000001U
#define PCR_RMT_READY_S  2

/** PCR_RMT_SCLK_CONF_REG register
 *  RMT_SCLK configuration register
 */
#define PCR_RMT_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x38)
/** PCR_RMT_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the rmt function clock.
 */
#define PCR_RMT_SCLK_DIV_A    0x0000003FU
#define PCR_RMT_SCLK_DIV_A_M  (PCR_RMT_SCLK_DIV_A_V << PCR_RMT_SCLK_DIV_A_S)
#define PCR_RMT_SCLK_DIV_A_V  0x0000003FU
#define PCR_RMT_SCLK_DIV_A_S  0
/** PCR_RMT_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the rmt function clock.
 */
#define PCR_RMT_SCLK_DIV_B    0x0000003FU
#define PCR_RMT_SCLK_DIV_B_M  (PCR_RMT_SCLK_DIV_B_V << PCR_RMT_SCLK_DIV_B_S)
#define PCR_RMT_SCLK_DIV_B_V  0x0000003FU
#define PCR_RMT_SCLK_DIV_B_S  6
/** PCR_RMT_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 1;
 *  The integral part of the frequency divider factor of the rmt function clock.
 */
#define PCR_RMT_SCLK_DIV_NUM    0x000000FFU
#define PCR_RMT_SCLK_DIV_NUM_M  (PCR_RMT_SCLK_DIV_NUM_V << PCR_RMT_SCLK_DIV_NUM_S)
#define PCR_RMT_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_RMT_SCLK_DIV_NUM_S  12
/** PCR_RMT_SCLK_SEL : R/W; bitpos: [20]; default: 1;
 *  set this field to select clock-source. 0: do not select anyone clock, 1(default):
 *  80MHz, 2: FOSC, 3: XTAL.
 */
#define PCR_RMT_SCLK_SEL    (BIT(20))
#define PCR_RMT_SCLK_SEL_M  (PCR_RMT_SCLK_SEL_V << PCR_RMT_SCLK_SEL_S)
#define PCR_RMT_SCLK_SEL_V  0x00000001U
#define PCR_RMT_SCLK_SEL_S  20
/** PCR_RMT_SCLK_EN : R/W; bitpos: [21]; default: 1;
 *  Set 1 to enable rmt function clock
 */
#define PCR_RMT_SCLK_EN    (BIT(21))
#define PCR_RMT_SCLK_EN_M  (PCR_RMT_SCLK_EN_V << PCR_RMT_SCLK_EN_S)
#define PCR_RMT_SCLK_EN_V  0x00000001U
#define PCR_RMT_SCLK_EN_S  21

