espressif/esp-idf/components/soc/esp32h2/register/soc/pcr_reg.h
/** PCR_CTRL_CLK_OUT_EN_REG register
 *  CLK_OUT_EN configuration register
 */
#define PCR_CTRL_CLK_OUT_EN_REG (DR_REG_PCR_BASE + 0x128)
/** PCR_CLK8_OEN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable 8m clock
 */
#define PCR_CLK8_OEN    (BIT(0))
#define PCR_CLK8_OEN_M  (PCR_CLK8_OEN_V << PCR_CLK8_OEN_S)
#define PCR_CLK8_OEN_V  0x00000001U
#define PCR_CLK8_OEN_S  0
/** PCR_CLK16_OEN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to enable 16m clock
 */
#define PCR_CLK16_OEN    (BIT(1))
#define PCR_CLK16_OEN_M  (PCR_CLK16_OEN_V << PCR_CLK16_OEN_S)
#define PCR_CLK16_OEN_V  0x00000001U
#define PCR_CLK16_OEN_S  1
/** PCR_CLK32_OEN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable 32m clock
 */
#define PCR_CLK32_OEN    (BIT(2))
#define PCR_CLK32_OEN_M  (PCR_CLK32_OEN_V << PCR_CLK32_OEN_S)
#define PCR_CLK32_OEN_V  0x00000001U
#define PCR_CLK32_OEN_S  2
/** PCR_CLK_ADC_INF_OEN : R/W; bitpos: [3]; default: 1;
 *  Reserved
 */
#define PCR_CLK_ADC_INF_OEN    (BIT(3))
#define PCR_CLK_ADC_INF_OEN_M  (PCR_CLK_ADC_INF_OEN_V << PCR_CLK_ADC_INF_OEN_S)
#define PCR_CLK_ADC_INF_OEN_V  0x00000001U
#define PCR_CLK_ADC_INF_OEN_S  3
/** PCR_CLK_DFM_INF_OEN : R/W; bitpos: [4]; default: 1;
 *  Reserved
 */
#define PCR_CLK_DFM_INF_OEN    (BIT(4))
#define PCR_CLK_DFM_INF_OEN_M  (PCR_CLK_DFM_INF_OEN_V << PCR_CLK_DFM_INF_OEN_S)
#define PCR_CLK_DFM_INF_OEN_V  0x00000001U
#define PCR_CLK_DFM_INF_OEN_S  4
/** PCR_CLK_SDM_MOD_OEN : R/W; bitpos: [5]; default: 1;
 *  Reserved
 */
#define PCR_CLK_SDM_MOD_OEN    (BIT(5))
#define PCR_CLK_SDM_MOD_OEN_M  (PCR_CLK_SDM_MOD_OEN_V << PCR_CLK_SDM_MOD_OEN_S)
#define PCR_CLK_SDM_MOD_OEN_V  0x00000001U
#define PCR_CLK_SDM_MOD_OEN_S  5
/** PCR_CLK_XTAL_OEN : R/W; bitpos: [6]; default: 1;
 *  Set 1 to enable xtal clock
 */
#define PCR_CLK_XTAL_OEN    (BIT(6))
#define PCR_CLK_XTAL_OEN_M  (PCR_CLK_XTAL_OEN_V << PCR_CLK_XTAL_OEN_S)
#define PCR_CLK_XTAL_OEN_V  0x00000001U
#define PCR_CLK_XTAL_OEN_S  6

/** PCR_CTRL_TICK_CONF_REG register
 *  TICK configuration register
 */
#define PCR_CTRL_TICK_CONF_REG (DR_REG_PCR_BASE + 0x12c)
/** PCR_XTAL_TICK_NUM : R/W; bitpos: [7:0]; default: 39;
 *  ******* Description ***********
 */
#define PCR_XTAL_TICK_NUM    0x000000FFU
#define PCR_XTAL_TICK_NUM_M  (PCR_XTAL_TICK_NUM_V << PCR_XTAL_TICK_NUM_S)
#define PCR_XTAL_TICK_NUM_V  0x000000FFU
#define PCR_XTAL_TICK_NUM_S  0
/** PCR_FOSC_TICK_NUM : R/W; bitpos: [15:8]; default: 7;
 *  ******* Description ***********
 */
#define PCR_FOSC_TICK_NUM    0x000000FFU
#define PCR_FOSC_TICK_NUM_M  (PCR_FOSC_TICK_NUM_V << PCR_FOSC_TICK_NUM_S)
#define PCR_FOSC_TICK_NUM_V  0x000000FFU
#define PCR_FOSC_TICK_NUM_S  8
/** PCR_TICK_ENABLE : R/W; bitpos: [16]; default: 1;
 *  ******* Description ***********
 */
#define PCR_TICK_ENABLE    (BIT(16))
#define PCR_TICK_ENABLE_M  (PCR_TICK_ENABLE_V << PCR_TICK_ENABLE_S)
#define PCR_TICK_ENABLE_V  0x00000001U
#define PCR_TICK_ENABLE_S  16
/** PCR_RST_TICK_CNT : R/W; bitpos: [17]; default: 0;
 *  ******* Description ***********
 */
#define PCR_RST_TICK_CNT    (BIT(17))
#define PCR_RST_TICK_CNT_M  (PCR_RST_TICK_CNT_V << PCR_RST_TICK_CNT_S)
#define PCR_RST_TICK_CNT_V  0x00000001U
#define PCR_RST_TICK_CNT_S  17

/** PCR_CTRL_32K_CONF_REG register
 *  32KHz clock configuration register
 */
#define PCR_CTRL_32K_CONF_REG (DR_REG_PCR_BASE + 0x130)
/** PCR_32K_SEL : R/W; bitpos: [1:0]; default: 0;
 *  This field indicates which one 32KHz clock will be used by timergroup. 0:
 *  OSC32K(default), 1: XTAL32K, 2/3: 32KHz from pad GPIO0.
 */
#define PCR_32K_SEL    0x00000003U
#define PCR_32K_SEL_M  (PCR_32K_SEL_V << PCR_32K_SEL_S)
#define PCR_32K_SEL_V  0x00000003U
#define PCR_32K_SEL_S  0
/** PCR_32K_MODEM_SEL : R/W; bitpos: [3:2]; default: 0;
 *  This field indicates which one 32KHz clock will be used by MODEM_SYSTEM. 0:
 *  OSC32K(default), 1: XTAL32K, 2/3: 32KHz from pad GPIO0.
 */
#define PCR_32K_MODEM_SEL    0x00000003U
#define PCR_32K_MODEM_SEL_M  (PCR_32K_MODEM_SEL_V << PCR_32K_MODEM_SEL_S)
#define PCR_32K_MODEM_SEL_V  0x00000003U
#define PCR_32K_MODEM_SEL_S  2

/** PCR_SRAM_POWER_CONF_0_REG register
 *  HP SRAM/ROM configuration register
 */
#define PCR_SRAM_POWER_CONF_0_REG (DR_REG_PCR_BASE + 0x134)
/** PCR_ROM_FORCE_PU : R/W; bitpos: [14:13]; default: 3;
 *  Set this bit to force power up ROM
 */
#define PCR_ROM_FORCE_PU    0x00000003U
#define PCR_ROM_FORCE_PU_M  (PCR_ROM_FORCE_PU_V << PCR_ROM_FORCE_PU_S)
#define PCR_ROM_FORCE_PU_V  0x00000003U
#define PCR_ROM_FORCE_PU_S  13
/** PCR_ROM_FORCE_PD : R/W; bitpos: [16:15]; default: 0;
 *  Set this bit to force power down ROM.
 */
#define PCR_ROM_FORCE_PD    0x00000003U
#define PCR_ROM_FORCE_PD_M  (PCR_ROM_FORCE_PD_V << PCR_ROM_FORCE_PD_S)
#define PCR_ROM_FORCE_PD_V  0x00000003U
#define PCR_ROM_FORCE_PD_S  15
/** PCR_ROM_CLKGATE_FORCE_ON : R/W; bitpos: [18:17]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the ROM. 0: A
 *  gate-clock will be used when accessing the ROM.
 */
#define PCR_ROM_CLKGATE_FORCE_ON    0x00000003U
#define PCR_ROM_CLKGATE_FORCE_ON_M  (PCR_ROM_CLKGATE_FORCE_ON_V << PCR_ROM_CLKGATE_FORCE_ON_S)
#define PCR_ROM_CLKGATE_FORCE_ON_V  0x00000003U
#define PCR_ROM_CLKGATE_FORCE_ON_S  17

/** PCR_SRAM_POWER_CONF_1_REG register
 *  HP SRAM/ROM configuration register
 */
#define PCR_SRAM_POWER_CONF_1_REG (DR_REG_PCR_BASE + 0x138)
/** PCR_SRAM_FORCE_PU : R/W; bitpos: [4:0]; default: 31;
 *  Set this bit to force power up SRAM
 */
#define PCR_SRAM_FORCE_PU    0x0000001FU
#define PCR_SRAM_FORCE_PU_M  (PCR_SRAM_FORCE_PU_V << PCR_SRAM_FORCE_PU_S)
#define PCR_SRAM_FORCE_PU_V  0x0000001FU
#define PCR_SRAM_FORCE_PU_S  0
/** PCR_SRAM_FORCE_PD : R/W; bitpos: [14:10]; default: 0;
 *  Set this bit to force power down SRAM.
 */
#define PCR_SRAM_FORCE_PD    0x0000001FU
#define PCR_SRAM_FORCE_PD_M  (PCR_SRAM_FORCE_PD_V << PCR_SRAM_FORCE_PD_S)
#define PCR_SRAM_FORCE_PD_V  0x0000001FU
#define PCR_SRAM_FORCE_PD_S  10
/** PCR_SRAM_CLKGATE_FORCE_ON : R/W; bitpos: [29:25]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A
 *  gate-clock will be used when accessing the SRAM.
 */
#define PCR_SRAM_CLKGATE_FORCE_ON    0x0000001FU
#define PCR_SRAM_CLKGATE_FORCE_ON_M  (PCR_SRAM_CLKGATE_FORCE_ON_V << PCR_SRAM_CLKGATE_FORCE_ON_S)
#define PCR_SRAM_CLKGATE_FORCE_ON_V  0x0000001FU
#define PCR_SRAM_CLKGATE_FORCE_ON_S  25

/** PCR_SEC_CONF_REG register
 *  xxxx
 */
#define PCR_SEC_CONF_REG (DR_REG_PCR_BASE + 0x13c)
/** PCR_SEC_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  xxxx
 */
#define PCR_SEC_CLK_SEL    0x00000003U
#define PCR_SEC_CLK_SEL_M  (PCR_SEC_CLK_SEL_V << PCR_SEC_CLK_SEL_S)
#define PCR_SEC_CLK_SEL_V  0x00000003U
#define PCR_SEC_CLK_SEL_S  0

/** PCR_ADC_INV_PHASE_CONF_REG register
 *  xxxx
 */
#define PCR_ADC_INV_PHASE_CONF_REG (DR_REG_PCR_BASE + 0x140)
/** PCR_CLK_ADC_INV_PHASE_ENA : R/W; bitpos: [0]; default: 0;
 *  xxxx
 */
#define PCR_CLK_ADC_INV_PHASE_ENA    (BIT(0))
#define PCR_CLK_ADC_INV_PHASE_ENA_M  (PCR_CLK_ADC_INV_PHASE_ENA_V << PCR_CLK_ADC_INV_PHASE_ENA_S)
#define PCR_CLK_ADC_INV_PHASE_ENA_V  0x00000001U
#define PCR_CLK_ADC_INV_PHASE_ENA_S  0

/** PCR_SDM_INV_PHASE_CONF_REG register
 *  xxxx
 */
#define PCR_SDM_INV_PHASE_CONF_REG (DR_REG_PCR_BASE + 0x144)
/** PCR_CLK_SDM_INV_PHASE_ENA : R/W; bitpos: [0]; default: 0;
 *  xxxx
 */
#define PCR_CLK_SDM_INV_PHASE_ENA    (BIT(0))
#define PCR_CLK_SDM_INV_PHASE_ENA_M  (PCR_CLK_SDM_INV_PHASE_ENA_V << PCR_CLK_SDM_INV_PHASE_ENA_S)
#define PCR_CLK_SDM_INV_PHASE_ENA_V  0x00000001U
#define PCR_CLK_SDM_INV_PHASE_ENA_S  0
/** PCR_CLK_SDM_INV_PHASE_SEL : R/W; bitpos: [3:1]; default: 0;
 *  xxxx
 */
#define PCR_CLK_SDM_INV_PHASE_SEL    0x00000007U
#define PCR_CLK_SDM_INV_PHASE_SEL_M  (PCR_CLK_SDM_INV_PHASE_SEL_V << PCR_CLK_SDM_INV_PHASE_SEL_S)
#define PCR_CLK_SDM_INV_PHASE_SEL_V  0x00000007U
#define PCR_CLK_SDM_INV_PHASE_SEL_S  1

/** PCR_BUS_CLK_UPDATE_REG register
 *  xxxx
 */
#define PCR_BUS_CLK_UPDATE_REG (DR_REG_PCR_BASE + 0x148)
/** PCR_BUS_CLOCK_UPDATE : R/W/WTC; bitpos: [0]; default: 0;
 *  xxxx
 */
#define PCR_BUS_CLOCK_UPDATE    (BIT(0))
#define PCR_BUS_CLOCK_UPDATE_M  (PCR_BUS_CLOCK_UPDATE_V << PCR_BUS_CLOCK_UPDATE_S)
#define PCR_BUS_CLOCK_UPDATE_V  0x00000001U
#define PCR_BUS_CLOCK_UPDATE_S  0

